students = {
  'Іван Петров': {
    'Пошта': 'Ivan@gmail.com',
    'Вік': 14,
    'Номер телефону': '+380987771221',
    'Середній бал': 95.8
  },
  'Женя Курич': {
    'Пошта': 'Geka@gmail.com',
    'Вік': 16,
    'Номер телефону': None,
    'Середній бал': 64.5
  },
  'Маша Кера': {
    'Пошта': 'Masha@gmail.com',
    'Вік': 18,
    'Номер телефону': '+380986671221',
    'Середній бал': 80
  },
}
students['Марина Бойко'] = {
    'Пошта': 'Maryna@gmail.com',
    'Вік': 29,
    'Номер телефону': '+380955551221',
    'Середній бал': 85
}
average_score = (students['Іван Петров']['Середній бал']
                 + students['Женя Курич']['Середній бал']
                 + students['Маша Кера']['Середній бал']
                 + students['Марина Бойко']['Середній бал']
                 ) / len(students)
students['Іван Петров']['bank_account_number'] = None
salary_data = students['Женя Курич'].get('Заробітна плата') or 0.0
print(salary_data)