# hometask_Graduation project
# Створити на основі FastAPI сайт
#
# тематика та алгоритм - або на ваш вибір (тоді самі продумуйте ендпойнти та поведінку), або за схемою нижче, проте в обох випадках дуже бажаними є:
#
# використання змінних оточення (.env файл з прикладами змінних в env-example файлі)
# poetry як менеджер віртуального оточення
# енергонезалежний механізм зберігання даних (база даних, в крайньому випадку csv чи json файл)
# реалізація CRUD операцій по АРІ
# як джерело додаткових даних можете використати власне апі на базі гугл таблиць (якщо у вас такі дані та ідеї є)
# додатковий механізм роботи з чужими АРІ (наприклад, для отримання курсів валют)
# код має бути опублікований на гіті
# всі (в тому числі і АРІ, і веб) ендпойнти мають бути покриті тестами мінімум на статус код (точно не має бути 500, дозволяється 2 чи 4 група кодів в залежності від переданих даних)
# опис ідеї сайту
#
# сайт-дошка оголошень з продажу автомобілів
#
# АРІ частина
#
# можемо розмістити оголошення - маємо вказати номер телефону, ціну в доларах США, список урлів з фотографіями авто (не менше 2-х, не більше 10), марку авто, модель авто, рік випуску (ціле число, не менше 2010), список додаткових опцій (Enum, може бути пустим), опис авто (не більше 300 символів, не менше 50) -> у відповідь отримуємо отримуємо словник з ключами: success: True, номер оголошення в системі (uuid), ціну даного авто в гривнях по комерційному курсу будь-якого комерційного банку (чи ваше джерело), ціна зберігається в доларах, інформація в гривнях оновлюється і є інформативною на час запиту, статус 201. Номер оголошення показується лише один раз при створенні, надалі це прихована інформація (вважаємо, що тільки автор буде його знати і таким чином керувати оголошенням). Марку та модель привести до верхнього регістру, при наявності пробілів на початку чи в кінці текстових даних їх потрібно обрізати
# створюємо ендпойнт для пошуку авто - передаємо параметри марки, ціни в доларах, року випуску, ліміт та скіп, повертаємо не більше 5 авто -> у відповідь отримуємо список словників з усіма валідними даними, окрім номеру оголошення
# ендпойнт для оновлення інформації по авто - в параметрах шляху передаємо номер оголошення, в тілі запиту поля з новими значеннями
# ендпойнт для видалення оголошення - приймає просто номер оголошення
# веб частина
#
# вкладка з усіма оголошеннями, але не більше 5 самих свіжих, для кожного авто показуємо не весь опис, а перші 60 символів, 1 фотографію малого масштабу, ціну та рік випуску
# робочий пошук - вводимо дані, шукаємо по марці, по року випуску, по ціні (всюди точне співпадіння з оглдяду на роботу регулярних виразів, більше в рамках курсу ми не встигнемо розглянути), віддаємо не більше 5 самих свіжих
# кожне оголошення клікабельне, ідентифікатором оголошення є його номер (не красиве рішення, згоден, оскільки будь-то по ньому може його видалити, але потрібно ж з чогось починати). - при відкритті бачимо всю інфу по авто, всі фотографії,
# реліз на сервер не обовязковий, всі фінансові витрати (якщо такі будуть) ви берете на себе
