# hometask_17
# розширити функціональність коду з уроку
#
# користувачу добавити метод, який покаже, чи він в позитивному балансі по його карткам (результат - булеве, можете оформити як проперті)
# в абстрактний клас базового рахунку добавити метод виведення коштів - перевірки аналогічні переведенню коштів на іншу картку
# в тестах іншому користувачу добавити нові рахунки (2 поточних та 2 кредитних)
# в рамках тестування переказати з кредитного рахунку першого користувача на будь-який рахунок іншого користувача 1,33грн - перевірити баланси, при потребі налаштувати округлення (погляньте у бік децимала)
# тести запускайте з терміналу
