# homework
# написати функцію, котра приймає час (в секундах), швидкість (метрів за секунду) та вагу автомобіля (кг). за допомогою * забезпечити, щоб всі аргументи можна було передати як keywords аргументи (типу speed=3)
#
# якщо хоч один із аргументів буде менше 0 - рейзимо помилку ValueError, текст помилки - на ваш вибір
#
# функція повертає стрічку, наступного змісту: "Транспортний засіб вагою 1000 кг рухався 10 секунд зі швидкістю 3м/сек, і подолав відстань 30 метрів"
#
# написати тести до даної функції
