# homework homeworking_with_sets_dictionaries_14
# написати програму, яка просить в користувача ввести через пробіл міста, в яких він був за минулі 10 років
#
# потім окремо запросити у користувача міста, куди він хоче поїхати внаступні 10 років
#
# вивести на екран повідомлення з текстом про те, що користувачу, мабуть, дуже сподобалося в містах, які він повторив в двох циклах вводу,
#
# якщо повтору не було - вивести повідомлення, що користувач відкритий до чогось нового
#
# врахувати випадки, що користувач нічого не вводить не потрібно, в даному випадку вам явно зазначено, що ці перевірки не потрібні.
#
# не потрібно перевіряти введення цифр
#
# ми виходим із того, що користувач введе щось на зразок "Київ Тернопіль париЖ акапулько"
#
# В той же час врахуйте, що користувач може вводити дані в різних регістрах
#
# використати сети